volunteer/app/controllers/events_controller.rb

  def new
    @event = Event.new
    @user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def show
    @user = User.find(params[:user_id])
    @event = Event.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]

  def index
    @user = User.find(params[:user_id])
    @events = Event.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT "events".* FROM "events"

  def create
    params.permit!
    @user = User.find(params[:user_id])
    @event = @user.events.create(params[:event])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "events" ("date", "name", "user_id", "description") VALUES (?, ?, ?, ?)  [["date", "2017-11-04"], ["name", "Cleanup "], ["user_id", 4], ["description", "spring cleanup at central park"]]

  def destroy
    @user = User.find(params[:user_id])
    event = Event.find(params[:id])
    event.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 10]]