volunteer/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."user_id" = ?  [["user_id", 5]]
---
  def show
    @user = User.find(params[:id])
    @event = Event.all

SELECT "users".* FROM "users"
SELECT "events".* FROM "events"
---
  def index
    @users = User.all
    @events = Event.all

INSERT INTO "users" ("name", "age", "username", "password", "school") VALUES (?, ?, ?, ?, ?)  [["name", "Erin Lee"], ["age", 14], ["username", "erinlee"], ["password", "erinlee"], ["school", "Stuyvesant"]]
---
  def create
    params.permit!
    @user = User.new(params[:user])
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "username" = ? WHERE "users"."id" = ?  [["name", "Erin Lee"], ["username", "erinlee"], ["id", 9]]
---
  def update
    params.permit!
    @user = User.find(params[:id])
    if @user.update(params[:user])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 6]]
---
  def destroy
    user = User.find(params[:id])
    user.destroy