rescue/app/controllers/animals_controller.rb

SELECT "animals".* FROM "animals"
---
  def index
    @animals = Animal.all

INSERT INTO "animals" ("name", "age", "kind", "location") VALUES (?, ?, ?, ?)  [["name", "Joshua"], ["age", 14], ["kind", "Human"], ["location", "New York"]]
---
  def create
    params.permit!

    @animal = Animal.new(params[:animal])
    if @animal.save

SELECT  "animals".* FROM "animals" WHERE "animals"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def show
    @animal = Animal.find(params[:id])